* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment
** Elapsed time
#+PLOT: title:"Elapsed time (No derailment)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-------------|
| Configuration              |    First |   Second |    Third |     Average |
|----------------------------+----------+----------+----------+-------------|
| Example with one train     |    0.004 |    0.005 |    0.003 |        4e-3 |
| Example with two trains    |    0.026 |    0.036 |    0.035 | 0.032333333 |
| Shared Segment             |    0.021 |    0.026 |    0.018 | 0.021666667 |
| Large Network              |    0.027 |    0.019 |    0.031 | 0.025666667 |
| Station One                |    0.022 |    0.029 |     0.03 |       0.027 |
| Station Two                |    0.239 |    0.238 |    0.267 |       0.248 |
| Station Four               |    8.876 |    8.574 |    8.899 |       8.783 |
| Station Six                |  188.438 |  186.981 |  186.655 |     187.358 |
| Station Eight              | 1156.889 | 1163.677 | 1160.076 |    1160.214 |
| Station Ten                | 4361.278 | 4361.654 | 4363.921 |   4362.2843 |
| Station Twelfth            |      DNA |      DNA |      DNA |         DNA |
| Two trains same direction  |    0.025 |    0.025 |    0.037 |       0.029 |
| Four trains same direction |      DNF |      DNF |      DNF |         DNF |
|----------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No derailment)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third |   Average |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |    5.972 |    5.976 |    5.992 |      5.98 |
| Example with two trains    |    7.000 |    7.072 |    7.204 |     7.092 |
| Shared Segment             |   10.056 |   10.072 |   10.072 | 10.066667 |
| Large Network              |    8.600 |    8.604 |    8.604 | 8.6026667 |
| Station One                |    6.160 |    6.232 |    6.368 | 6.2533333 |
| Station Two                |    9.920 |    9.932 |    9.932 |     9.928 |
| Station Four               |   47.116 |   47.204 |   47.208 |    47.176 |
| Station Six                |  204.812 |  204.884 |  205.068 | 204.92133 |
| Station Eight              |  509.568 |  509.792 |  509.752 |   509.704 |
| Station Ten                | 1035.876 | 1036.220 | 1036.220 | 1036.1053 |
| Station Twelfth            |      DNA |      DNA |      DNA |       DNA |
| Two trains same direction  |    8.920 |    9.976 |    9.984 | 9.6266667 |
| Four trains same direction |      DNF |      DNF |      DNF |       DNF |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
#+PLOT: title:"Elapsed time (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.003 |    0.002 | 2.3333333e-3 |
| Example with two trains    |     0.03 |    0.039 |    0.028 |  0.032333333 |
| Shared Segment             |    0.031 |    0.022 |    0.024 |  0.025666667 |
| Large Network              |    0.024 |    0.028 |    0.029 |        0.027 |
| Station One                |     0.02 |    0.015 |     0.02 |  0.018333333 |
| Station Two                |    0.264 |    0.282 |    0.258 |        0.268 |
| Station Four               |    8.639 |    9.236 |    8.701 |    8.8586667 |
| Station Six                |  184.618 |  185.231 |  185.743 |    185.19733 |
| Station Eight              | 1160.129 | 1159.479 | 1155.205 |     1158.271 |
| Station Ten                | 4377.532 | 4388.594 | 4372.717 |    4379.6143 |
| Station Twelfth            |      DNA |      DNA |      DNA |          DNA |
| Two trains same direction  |    0.036 |    0.037 |    0.045 |  0.039333333 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (No collision)" deps:(5) set:"xrange[0:]"
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third |   Average |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.604 |   5.608 |   5.608 | 5.6066667 |
| Example with two trains    |   6.288 |   6.360 |   6.492 |      6.38 |
| Shared Segment             |   7.052 |   7.064 |   7.068 | 7.0613333 |
| Large Network              |   8.596 |   8.600 |   8.600 | 8.5986667 |
| Station One                |   6.156 |   6.228 |   6.360 |     6.248 |
| Station Two                |   9.920 |   9.928 |   9.928 | 9.9253333 |
| Station Four               |  47.112 |  47.200 |  47.212 | 47.174667 |
| Station Six                | 180.452 | 180.528 | 180.708 | 180.56267 |
| Station Eight              | 509.564 | 509.740 | 509.752 | 509.68533 |
| Station Ten                | 939.680 | 940.020 | 940.020 | 939.90667 |
| Station Twelfth            |     DNA |     DNA |     DNA |       DNA |
| Two trains same direction  |   7.080 |   7.092 |   7.096 | 7.0893333 |
| Four trains same direction |     DNF |     DNF |     DNF |       DNF |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
#+PLOT: title:"Elapsed time (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+----------+----------+--------------|
| Configuration              |    First |   Second |    Third |      Average |
|----------------------------+----------+----------+----------+--------------|
| Example with one train     |    0.002 |    0.004 |    0.005 | 3.6666667e-3 |
| Example with two trains    |    0.028 |    0.035 |    0.031 |  0.031333333 |
| Shared Segment             |    0.012 |    0.021 |    0.025 |  0.019333333 |
| Large Network              |    0.021 |    0.035 |    0.034 |         0.03 |
| Station One                |    0.022 |    0.015 |    0.012 |  0.016333333 |
| Station Two                |    0.237 |    0.247 |     0.28 |   0.25466667 |
| Station Four               |    8.653 |    8.897 |    8.594 |    8.7146667 |
| Station Six                |  182.855 |   182.71 |  183.536 |    183.03367 |
| Station Eight              | 1150.706 | 1160.261 | 1151.246 |     1154.071 |
| Station Ten                | 4361.551 | 4339.703 | 4359.661 |    4353.6383 |
| Station Twelfth            |      DNA |      DNA |      DNA |          DNA |
| Two trains same direction  |    0.038 |    0.034 |     0.03 |        0.034 |
| Four trains same direction |      DNF |      DNF |      DNF |          DNF |
|----------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
#+PLOT: title:"Memory Usage Peak (Will arrive)" deps:(5) set:"xrange[0:]"
|----------------------------+----------+---------+---------+-----------|
| Configuration              |    First |  Second |   Third |   Average |
|----------------------------+----------+---------+---------+-----------|
| Example with one train     |    5.592 |   5.592 |   5.592 |     5.592 |
| Example with two trains    |    6.238 |   6.272 |   6.272 | 6.2606667 |
| Shared Segment             |    7.032 |   7.040 |   7.044 | 7.0386667 |
| Large Network              |    8.584 |   8.584 |   8.584 |     8.584 |
| Station One                |    6.136 |   6.140 |   6.144 |      6.14 |
| Station Two                |    9.908 |   9.908 |   9.908 |     9.908 |
| Station Four               |   47.080 |  47.164 |  47.168 | 47.137333 |
| Station Six                |  180.352 | 180.428 | 180.428 | 180.40267 |
| Station Eight              |  509.126 | 509.312 | 509.316 | 509.25133 |
| Station Ten                | 1263.696 |         |         |  1263.696 |
| Station Twelfth            |      DNA |     DNA |     DNA |       DNA |
| Two trains same direction  |    7.056 |   7.064 |   7.064 | 7.0613333 |
| Four trains same direction |      DNF |     DNF |     DNF |       DNF |
|----------------------------+----------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
